Below is the full output of the terraform plan command, but there is no mention of `forces replacement`.

<details>
<summary>Terraform Plan Output</summary>

```shell
terraform plan
Initializing the backend...
Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching ">= 2.0.0"...
- Installing hashicorp/kubernetes v2.13.1...
- Installed hashicorp/kubernetes v2.13.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
Terraform has been successfully initialized!
kubernetes_secret.active_directory_secure_settings["devtest"]: Refreshing state... [id=elastic-test/active-directory-secure-settings-devtest]
kubernetes_secret.ca_certificates_crt: Refreshing state... [id=elastic-test/tls-ca]
kubernetes_secret.s3_secure_settings["es_test_snapshots"]: Refreshing state... [id=elastic-test/s3-secure-settings-es-test-snapshots]
kubernetes_secret.watcher_encryption_secure_settings[0]: Refreshing state... [id=elastic-test/watcher-encryption-secure-settings]
kubernetes_manifest.elasticsearch_cert: Refreshing state...
kubernetes_manifest.elasticsearch_virtualservice["istio-system/elastic-test-domain-com"]: Refreshing state...
kubernetes_manifest.elasticsearch_virtualservice["istio-system/elastic-test-domain-com"]: Refreshing state...
kubernetes_manifest.elasticsearch_destinationrule[0]: Refreshing state...
kubernetes_manifest.elasticsearch: Refreshing state...
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
Terraform will perform the following actions:
  # kubernetes_manifest.elasticsearch must be replaced
-/+ resource "kubernetes_manifest" "elasticsearch" {
      ~ manifest        = {
          ~ spec       = {
              ~ nodeSets                = [
                  ~ {
                        name                 = "rack1"
                      ~ podTemplate          = {
                          ~ spec = {
                              ~ containers                   = [
                                  ~ {
                                        name         = "elasticsearch"
                                      ~ resources    = {
                                          ~ requests = {
                                              ~ cpu    = "1" -> "2"
                                                # (1 unchanged element hidden)
                                            }
                                            # (1 unchanged element hidden)
                                        }
                                        # (1 unchanged element hidden)
                                    },
                                ]
                                # (4 unchanged elements hidden)
                            }
                        }
                        # (3 unchanged elements hidden)
                    },
                    {
                        config               = {
                            cluster = {
                                routing = {
                                    allocation = {
                                        awareness = {
                                            attributes = "k8s_node_name,zone"
                                        }
                                    }
                                }
                            }
                            node    = {
                                attr = {
                                    zone = "rack2"
                                }
                            }
                            xpack   = {
                                security = {
                                    audit = {
                                        enabled = true
                                    }
                                    authc = {
                                        realms = {
                                            active_directory = {
                                                devtest = {
                                                    <snipped; but no diffs/changes marked here>
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                        count                = 1
                        name                 = "rack2"
                        podTemplate          = {
                            spec = {
                                affinity                     = {
                                    nodeAffinity    = {
                                        requiredDuringSchedulingIgnoredDuringExecution = {
                                            nodeSelectorTerms = [
                                                {
                                                    matchExpressions = [
                                                        {
                                                            key      = "topology.kubernetes.io/zone"
                                                            operator = "In"
                                                            values   = [
                                                                "rack2",
                                                            ]
                                                        },
                                                        {
                                                            key      = "elastic.domain.com/environment-test"
                                                            operator = "In"
                                                            values   = [
                                                                "true",
                                                            ]
                                                        },
                                                    ]
                                                },
                                            ]
                                        }
                                    }
                                    podAntiAffinity = {
                                        preferredDuringSchedulingIgnoredDuringExecution = [
                                            {
                                                podAffinityTerm = {
                                                    labelSelector = {
                                                        matchLabels = {
                                                            "elasticsearch.k8s.elastic.co/cluster-name" = "elasticsearch"
                                                        }
                                                    }
                                                    topologyKey   = "kubernetes.io/hostname"
                                                }
                                                weight          = 100
                                            },
                                        ]
                                    }
                                }
                                automountServiceAccountToken = true
                                containers                   = [
                                    {
                                        name         = "elasticsearch"
                                        resources    = {
                                            limits   = {
                                                cpu    = "4"
                                                memory = "8Gi"
                                            }
                                            requests = {
                                                cpu    = "1"
                                                memory = "8Gi"
                                            }
                                        }
                                        volumeMounts = [
                                            {
                                                mountPath = "/usr/share/elasticsearch/config/certs"
                                                name      = "tls-ca"
                                            },
                                        ]
                                    },
                                ]
                                initContainers               = [
                                    {
                                        command         = [
                                            "sh",
                                            "-c",
                                            "sysctl -w vm.max_map_count=262144",
                                        ]
                                        name            = "sysctl"
                                        securityContext = {
                                            privileged = true
                                        }
                                    },
                                ]
                                volumes                      = [
                                    {
                                        name   = "tls-ca"
                                        secret = {
                                            secretName = "tls-ca"
                                        }
                                    },
                                ]
                            }
                        }
                        volumeClaimTemplates = [
                            {
                                metadata = {
                                    name = "elasticsearch-data"
                                }
                                spec     = {
                                    accessModes      = [
                                        "ReadWriteOnce",
                                    ]
                                    resources        = {
                                        requests = {
                                            storage = "500Gi"
                                        }
                                    }
                                    storageClassName = "openebs-hot"
                                }
                            },
                        ]
                    },
                    # (1 unchanged element hidden)
                ]
                # (6 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object          = {
          ~ metadata   = {
              ~ annotations                = {
                  - "eck.k8s.elastic.co/orchestration-hints"    = jsonencode(
                        {
                          - no_transient_settings = true
                          - service_accounts      = true
                        }
                    )
                  - "elasticsearch.k8s.elastic.co/cluster-uuid" = "kq-OmZ83Qj259Q6sTjgA6A"
                } -> (known after apply)
              ~ clusterName                = null -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "elasticsearch"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ auth                    = {
                  ~ fileRealm = null -> (known after apply)
                  ~ roles     = null -> (known after apply)
                }
              ~ http                    = {
                  ~ service = {
                      ~ metadata = {
                          ~ annotations = null -> (known after apply)
                          ~ finalizers  = null -> (known after apply)
                          ~ labels      = null -> (known after apply)
                          ~ name        = null -> (known after apply)
                          ~ namespace   = null -> (known after apply)
                        }
                      ~ spec     = {
                          ~ allocateLoadBalancerNodePorts = null -> (known after apply)
                          ~ clusterIP                     = null -> (known after apply)
                          ~ clusterIPs                    = null -> (known after apply)
                          ~ externalIPs                   = null -> (known after apply)
                          ~ externalName                  = null -> (known after apply)
                          ~ externalTrafficPolicy         = null -> (known after apply)
                          ~ healthCheckNodePort           = null -> (known after apply)
                          ~ internalTrafficPolicy         = null -> (known after apply)
                          ~ ipFamilies                    = null -> (known after apply)
                          ~ ipFamilyPolicy                = null -> (known after apply)
                          ~ loadBalancerClass             = null -> (known after apply)
                          ~ loadBalancerIP                = null -> (known after apply)
                          ~ loadBalancerSourceRanges      = null -> (known after apply)
                          ~ ports                         = null -> (known after apply)
                          ~ publishNotReadyAddresses      = null -> (known after apply)
                          ~ sessionAffinity               = null -> (known after apply)
                          ~ sessionAffinityConfig         = {
                              ~ clientIP = {
                                  ~ timeoutSeconds = null -> (known after apply)
                                }
                            }
                          ~ type                          = null -> (known after apply)
                            # (1 unchanged element hidden)
                        }
                    }
                  ~ tls     = {
                      ~ selfSignedCertificate = {
                          ~ disabled        = null -> (known after apply)
                          ~ subjectAltNames = null -> (known after apply)
                        }
                        # (1 unchanged element hidden)
                    }
                }
              ~ image                   = null -> (known after apply)
              ~ monitoring              = {
                  ~ logs    = {
                      ~ elasticsearchRefs = null -> (known after apply)
                    }
                  ~ metrics = {
                      ~ elasticsearchRefs = null -> (known after apply)
                    }
                }
              ~ nodeSets                = [
                  ~ {
                        name                 = "rack1"
                      ~ podTemplate          = {
                          ~ spec = {
                              ~ containers                   = [
                                  ~ {
                                        name         = "elasticsearch"
                                      ~ resources    = {
                                          ~ requests = {
                                              ~ cpu    = "1" -> "2"
                                                # (1 unchanged element hidden)
                                            }
                                            # (1 unchanged element hidden)
                                        }
                                        # (1 unchanged element hidden)
                                    },
                                ]
                                # (4 unchanged elements hidden)
                            }
                        }
                      ~ volumeClaimTemplates = [
                          ~ {
                              ~ apiVersion = null -> (known after apply)
                              ~ kind       = null -> (known after apply)
                              ~ metadata   = {
                                  ~ annotations = null -> (known after apply)
                                  ~ finalizers  = null -> (known after apply)
                                  ~ labels      = null -> (known after apply)
                                    name        = "elasticsearch-data"
                                  ~ namespace   = null -> (known after apply)
                                }
                              ~ spec       = {
                                  ~ dataSource       = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ dataSourceRef    = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ resources        = {
                                      ~ limits   = null -> (known after apply)
                                        # (1 unchanged element hidden)
                                    }
                                  ~ selector         = {
                                      ~ matchExpressions = null -> (known after apply)
                                      ~ matchLabels      = null -> (known after apply)
                                    }
                                  ~ volumeMode       = null -> (known after apply)
                                  ~ volumeName       = null -> (known after apply)
                                    # (2 unchanged elements hidden)
                                }
                              ~ status     = {
                                  ~ accessModes        = null -> (known after apply)
                                  ~ allocatedResources = null -> (known after apply)
                                  ~ capacity           = null -> (known after apply)
                                  ~ conditions         = null -> (known after apply)
                                  ~ phase              = null -> (known after apply)
                                  ~ resizeStatus       = null -> (known after apply)
                                }
                            },
                        ]
                        # (2 unchanged elements hidden)
                    },
                  ~ {
                        name                 = "rack2"
                      ~ volumeClaimTemplates = [
                          ~ {
                              ~ apiVersion = null -> (known after apply)
                              ~ kind       = null -> (known after apply)
                              ~ metadata   = {
                                  ~ annotations = null -> (known after apply)
                                  ~ finalizers  = null -> (known after apply)
                                  ~ labels      = null -> (known after apply)
                                    name        = "elasticsearch-data"
                                  ~ namespace   = null -> (known after apply)
                                }
                              ~ spec       = {
                                  ~ dataSource       = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ dataSourceRef    = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ resources        = {
                                      ~ limits   = null -> (known after apply)
                                        # (1 unchanged element hidden)
                                    }
                                  ~ selector         = {
                                      ~ matchExpressions = null -> (known after apply)
                                      ~ matchLabels      = null -> (known after apply)
                                    }
                                  ~ volumeMode       = null -> (known after apply)
                                  ~ volumeName       = null -> (known after apply)
                                    # (2 unchanged elements hidden)
                                }
                              ~ status     = {
                                  ~ accessModes        = null -> (known after apply)
                                  ~ allocatedResources = null -> (known after apply)
                                  ~ capacity           = null -> (known after apply)
                                  ~ conditions         = null -> (known after apply)
                                  ~ phase              = null -> (known after apply)
                                  ~ resizeStatus       = null -> (known after apply)
                                }
                            },
                        ]
                        # (3 unchanged elements hidden)
                    },
                  ~ {
                        name                 = "rack5"
                      ~ volumeClaimTemplates = [
                          ~ {
                              ~ apiVersion = null -> (known after apply)
                              ~ kind       = null -> (known after apply)
                              ~ metadata   = {
                                  ~ annotations = null -> (known after apply)
                                  ~ finalizers  = null -> (known after apply)
                                  ~ labels      = null -> (known after apply)
                                    name        = "elasticsearch-data"
                                  ~ namespace   = null -> (known after apply)
                                }
                              ~ spec       = {
                                  ~ dataSource       = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ dataSourceRef    = {
                                      ~ apiGroup = null -> (known after apply)
                                      ~ kind     = null -> (known after apply)
                                      ~ name     = null -> (known after apply)
                                    }
                                  ~ resources        = {
                                      ~ limits   = null -> (known after apply)
                                        # (1 unchanged element hidden)
                                    }
                                  ~ selector         = {
                                      ~ matchExpressions = null -> (known after apply)
                                      ~ matchLabels      = null -> (known after apply)
                                    }
                                  ~ volumeMode       = null -> (known after apply)
                                  ~ volumeName       = null -> (known after apply)
                                    # (2 unchanged elements hidden)
                                }
                              ~ status     = {
                                  ~ accessModes        = null -> (known after apply)
                                  ~ allocatedResources = null -> (known after apply)
                                  ~ capacity           = null -> (known after apply)
                                  ~ conditions         = null -> (known after apply)
                                  ~ phase              = null -> (known after apply)
                                  ~ resizeStatus       = null -> (known after apply)
                                }
                            },
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
              ~ podDisruptionBudget     = {
                  ~ metadata = {
                      ~ annotations = null -> (known after apply)
                      ~ finalizers  = null -> (known after apply)
                      ~ labels      = null -> (known after apply)
                      ~ name        = null -> (known after apply)
                      ~ namespace   = null -> (known after apply)
                    }
                  ~ spec     = {
                      ~ maxUnavailable = null -> (known after apply)
                      ~ minAvailable   = null -> (known after apply)
                      ~ selector       = {
                          ~ matchExpressions = null -> (known after apply)
                          ~ matchLabels      = null -> (known after apply)
                        }
                    }
                }
              ~ remoteClusters          = null -> (known after apply)
              ~ revisionHistoryLimit    = null -> (known after apply)
              ~ secureSettings          = [
                  ~ {
                      ~ entries    = null -> (known after apply)
                        # (1 unchanged element hidden)
                    },
                  ~ {
                      ~ entries    = null -> (known after apply)
                        # (1 unchanged element hidden)
                    },
                  ~ {
                      ~ entries    = null -> (known after apply)
                        # (1 unchanged element hidden)
                    },
                ]
              ~ serviceAccountName      = null -> (known after apply)
              ~ transport               = {
                  ~ service = {
                      ~ metadata = {
                          ~ annotations = null -> (known after apply)
                          ~ finalizers  = null -> (known after apply)
                          ~ labels      = null -> (known after apply)
                          ~ name        = null -> (known after apply)
                          ~ namespace   = null -> (known after apply)
                        }
                      ~ spec     = {
                          ~ allocateLoadBalancerNodePorts = null -> (known after apply)
                          ~ clusterIP                     = null -> (known after apply)
                          ~ clusterIPs                    = null -> (known after apply)
                          ~ externalIPs                   = null -> (known after apply)
                          ~ externalName                  = null -> (known after apply)
                          ~ externalTrafficPolicy         = null -> (known after apply)
                          ~ healthCheckNodePort           = null -> (known after apply)
                          ~ internalTrafficPolicy         = null -> (known after apply)
                          ~ ipFamilies                    = null -> (known after apply)
                          ~ ipFamilyPolicy                = null -> (known after apply)
                          ~ loadBalancerClass             = null -> (known after apply)
                          ~ loadBalancerIP                = null -> (known after apply)
                          ~ loadBalancerSourceRanges      = null -> (known after apply)
                          ~ ports                         = null -> (known after apply)
                          ~ publishNotReadyAddresses      = null -> (known after apply)
                          ~ selector                      = null -> (known after apply)
                          ~ sessionAffinity               = null -> (known after apply)
                          ~ sessionAffinityConfig         = {
                              ~ clientIP = {
                                  ~ timeoutSeconds = null -> (known after apply)
                                }
                            }
                          ~ type                          = null -> (known after apply)
                        }
                    }
                  ~ tls     = {
                      ~ certificate     = {
                          ~ secretName = null -> (known after apply)
                        }
                      ~ otherNameSuffix = null -> (known after apply)
                      ~ subjectAltNames = null -> (known after apply)
                    }
                }
                # (3 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
        # (1 unchanged block hidden)
    }
Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>